In [10]:
import SQL
SQL.import_SQL()

Requirement already satisfied: ipython-sql in /Users/shannoningram/opt/anaconda3/lib/python3.9/site-packages (0.5.0)
Requirement already satisfied: prettytable in /Users/shannoningram/opt/anaconda3/lib/python3.9/site-packages (from ipython-sql) (3.7.0)
Requirement already satisfied: ipython in /Users/shannoningram/opt/anaconda3/lib/python3.9/site-packages (from ipython-sql) (8.2.0)
Requirement already satisfied: sqlalchemy>=2.0 in /Users/shannoningram/opt/anaconda3/lib/python3.9/site-packages (from ipython-sql) (2.0.12)
Requirement already satisfied: sqlparse in /Users/shannoningram/opt/anaconda3/lib/python3.9/site-packages (from ipython-sql) (0.4.4)
Requirement already satisfied: six in /Users/shannoningram/opt/anaconda3/lib/python3.9/site-packages (from ipython-sql) (1.16.0)
Requirement already satisfied: ipython-genutils in /Users/shannoningram/opt/anaconda3/lib/python3.9/site-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: typing-extensions>=4.2.0 in /Users/shannoningram/opt/anaconda3/lib/python3.9/site-packages (from sqlalchemy>=2.0->ipython-sql) (4.5.0)
Requirement already satisfied: greenlet!=0.4.17 in /Users/shannoningram/opt/anaconda3/lib/python3.9/site-packages (from sqlalchemy>=2.0->ipython-sql) (1.1.1)
Requirement already satisfied: backcall in /Users/shannoningram/opt/anaconda3/lib/python3.9/site-packages (from ipython->ipython-sql) (0.2.0)
Requirement already satisfied: decorator in /Users/shannoningram/opt/anaconda3/lib/python3.9/site-packages (from ipython->ipython-sql) (5.1.1)
Requirement already satisfied: jedi>=0.16 in /Users/shannoningram/opt/anaconda3/lib/python3.9/site-packages (from ipython->ipython-sql) (0.18.1)
Requirement already satisfied: matplotlib-inline in /Users/shannoningram/opt/anaconda3/lib/python3.9/site-packages (from ipython->ipython-sql) (0.1.2)
Requirement already satisfied: pickleshare in /Users/shannoningram/opt/anaconda3/lib/python3.9/site-packages (from ipython->ipython-sql) (0.7.5)
Requirement already satisfied: prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0 in /Users/shannoningram/opt/anaconda3/lib/python3.9/site-packages (from ipython->ipython-sql) (3.0.20)
Requirement already satisfied: pygments>=2.4.0 in /Users/shannoningram/opt/anaconda3/lib/python3.9/site-packages (from ipython->ipython-sql) (2.11.2)
Requirement already satisfied: setuptools>=18.5 in /Users/shannoningram/opt/anaconda3/lib/python3.9/site-packages (from ipython->ipython-sql) (61.2.0)
Requirement already satisfied: stack-data in /Users/shannoningram/opt/anaconda3/lib/python3.9/site-packages (from ipython->ipython-sql) (0.2.0)
Requirement already satisfied: traitlets>=5 in /Users/shannoningram/opt/anaconda3/lib/python3.9/site-packages (from ipython->ipython-sql) (5.1.1)
Requirement already satisfied: pexpect>4.3 in /Users/shannoningram/opt/anaconda3/lib/python3.9/site-packages (from ipython->ipython-sql) (4.8.0)
Requirement already satisfied: appnope in /Users/shannoningram/opt/anaconda3/lib/python3.9/site-packages (from ipython->ipython-sql) (0.1.2)
Requirement already satisfied: wcwidth in /Users/shannoningram/opt/anaconda3/lib/python3.9/site-packages (from prettytable->ipython-sql) (0.2.5)
Requirement already satisfied: parso<0.9.0,>=0.8.0 in /Users/shannoningram/opt/anaconda3/lib/python3.9/site-packages (from jedi>=0.16->ipython->ipython-sql) (0.8.3)
Requirement already satisfied: ptyprocess>=0.5 in /Users/shannoningram/opt/anaconda3/lib/python3.9/site-packages (from pexpect>4.3->ipython->ipython-sql) (0.7.0)
Requirement already satisfied: executing in /Users/shannoningram/opt/anaconda3/lib/python3.9/site-packages (from stack-data->ipython->ipython-sql) (0.8.3)
Requirement already satisfied: asttokens in /Users/shannoningram/opt/anaconda3/lib/python3.9/site-packages (from stack-data->ipython->ipython-sql) (2.0.5)
Requirement already satisfied: pure-eval in /Users/shannoningram/opt/anaconda3/lib/python3.9/site-packages (from stack-data->ipython->ipython-sql) (0.2.2)

In [11]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [12]:
%sql sqlite://

In [4]:
%%sql
CREATE TABLE sales
(
    key       varchar(6),
    ts        timestamp,
    product   integer,
    completed boolean,
    price     float
);
INSERT INTO sales
VALUES ('sale_1', '2019-11-08 00:00', 102230, TRUE, 1.1),
       ('sale_2', '2019-11-08 01:00', 102320, FALSE, 1.2),
       ('sale_3', '2019-11-08 01:00', 102010, TRUE, 1.3),
       ('sale_4', '2019-11-08 01:00', 102023, FALSE, 1.4),
       ('sale_5', '2019-11-08 02:00', 102008, TRUE, 1.5),
       ('sale_6', '2019-11-08 02:00', 102913, TRUE, 1.5);

 * sqlite://
Done.
6 rows affected.

[]

In [13]:
 %reload_ext sql

In [14]:
%%sql
CREATE TABLE grades

(
    class     varchar(10),
    grade     integer,
    credit    integer,
    major     boolean,
    minor     boolean
);
INSERT INTO grades
VALUES ('CS303E', 78, 3, FALSE, FALSE),
       ('PSY317L', 87, 3, TRUE, FALSE),
       ('AFR305', 91, 3, FALSE, TRUE),
       ('PSY420M', 86, 3, TRUE,FALSE),
       ('PSY420P', 88, 3, TRUE, FALSE);

 * sqlite://
Done.
5 rows affected.

[]

# Select
SELECT: This is used to retrieve data from a database. You can use SELECT to specify which columns you want to retrieve, and from which table. For example, the following SQL statement retrieves all columns from the sales table:

In [5]:
%%sql
select * from sales;

 * sqlite://
Done.

[('sale_1', '2019-11-08 00:00', 102230, 1, 1.1),
 ('sale_2', '2019-11-08 01:00', 102320, 0, 1.2),
 ('sale_3', '2019-11-08 01:00', 102010, 1, 1.3),
 ('sale_4', '2019-11-08 01:00', 102023, 0, 1.4),
 ('sale_5', '2019-11-08 02:00', 102008, 1, 1.5),
 ('sale_6', '2019-11-08 02:00', 102913, 1, 1.5)]

In [17]:
%%sql
select * from grades;

 * sqlite://
Done.

[('CS303E', 78, 3, 0, 0),
 ('PSY317L', 87, 3, 1, 0),
 ('AFR305', 91, 3, 0, 1),
 ('PSY420M', 86, 3, 1, 0),
 ('PSY420P', 88, 3, 1, 0)]

# Where
This is used to filter data based on specified criteria. For example, the following SQL statement retrieves orders with a price greater than 1.4:

In [6]:
%%sql
select * from sales
where price > 1.4;

 * sqlite://
Done.

[('sale_5', '2019-11-08 02:00', 102008, 1, 1.5),
 ('sale_6', '2019-11-08 02:00', 102913, 1, 1.5)]

In [18]:
%%sql
select * from grades
where major = 1;

 * sqlite://
Done.

[('PSY317L', 87, 3, 1, 0), ('PSY420M', 86, 3, 1, 0), ('PSY420P', 88, 3, 1, 0)]

In [19]:
%%sql
select * from grades
where major = 0;

 * sqlite://
Done.

[('CS303E', 78, 3, 0, 0), ('AFR305', 91, 3, 0, 1)]

# Insert into
This is used to insert new data into a table. You must specify the table name and the values you want to insert into each column. For example:

In [7]:
%%sql
insert into sales (key, ts, product, completed, price)
values ('sale_7', '2019-11-09 02:00', 102135, TRUE, 1.6);

 * sqlite://
1 rows affected.

[]

In [20]:
%%sql
insert into grades (class,grade,credit,major,minor)
values ('ITD301', 88, 1, FALSE, FALSE);

 * sqlite://
1 rows affected.

[]

In [8]:
%%sql
select * from sales;

 * sqlite://
Done.

[('sale_1', '2019-11-08 00:00', 102230, 1, 1.1),
 ('sale_2', '2019-11-08 01:00', 102320, 0, 1.2),
 ('sale_3', '2019-11-08 01:00', 102010, 1, 1.3),
 ('sale_4', '2019-11-08 01:00', 102023, 0, 1.4),
 ('sale_5', '2019-11-08 02:00', 102008, 1, 1.5),
 ('sale_6', '2019-11-08 02:00', 102913, 1, 1.5),
 ('sale_7', '2019-11-09 02:00', 102135, 1, 1.6)]

In [21]:
%%sql
select * from grades;

 * sqlite://
Done.

[('CS303E', 78, 3, 0, 0),
 ('PSY317L', 87, 3, 1, 0),
 ('AFR305', 91, 3, 0, 1),
 ('PSY420M', 86, 3, 1, 0),
 ('PSY420P', 88, 3, 1, 0),
 ('ITD301', 88, 1, 0, 0)]

# UPDATE
This is used to update existing data in a table. You must specify the table name, the column(s) to update, and the new value(s) for the column(s). You can also use WHERE to specify which rows to update. First we'll use ALTER TABLE to ADD COLUMN to sales. For example:

In [9]:
%%sql
alter table sales
add column name text;

update sales
set name = 'shannon'
where key = 'sale_1';


select * from sales;

 * sqlite://
Done.
1 rows affected.
Done.

[('sale_1', '2019-11-08 00:00', 102230, 1, 1.1, 'shannon'),
 ('sale_2', '2019-11-08 01:00', 102320, 0, 1.2, None),
 ('sale_3', '2019-11-08 01:00', 102010, 1, 1.3, None),
 ('sale_4', '2019-11-08 01:00', 102023, 0, 1.4, None),
 ('sale_5', '2019-11-08 02:00', 102008, 1, 1.5, None),
 ('sale_6', '2019-11-08 02:00', 102913, 1, 1.5, None),
 ('sale_7', '2019-11-09 02:00', 102135, 1, 1.6, None)]

In [22]:
%%sql
alter table grades
add column topic text;

update grades
set topic = 'Intro to computer science'
where class = 'CS303E';

select * from grades

 * sqlite://
Done.
1 rows affected.
Done.

[('CS303E', 78, 3, 0, 0, 'Intro to computer science'),
 ('PSY317L', 87, 3, 1, 0, None),
 ('AFR305', 91, 3, 0, 1, None),
 ('PSY420M', 86, 3, 1, 0, None),
 ('PSY420P', 88, 3, 1, 0, None),
 ('ITD301', 88, 1, 0, 0, None)]